In [279]:
table = [
    {   "name": "aaa", "id":11, "sal": 100},
    { "name" : "bbb", "id": 23, "sal" : 99},
    { "name": "cc", "id": 24, "sal": "null"}
]    #created a list of dictionaries

names = [row["name"] for row in table]     

ids = [row["id"] for row in table]

sals = [row["sal"] for row in table]

print(table)

table.append({"name": "aaa", "id":11, "sal": 100})  #add new data to existing list using append method

print(table)

[{'name': 'aaa', 'id': 11, 'sal': 100}, {'name': 'bbb', 'id': 23, 'sal': 99}, {'name': 'cc', 'id': 24, 'sal': 'null'}]
[{'name': 'aaa', 'id': 11, 'sal': 100}, {'name': 'bbb', 'id': 23, 'sal': 99}, {'name': 'cc', 'id': 24, 'sal': 'null'}, {'name': 'aaa', 'id': 11, 'sal': 100}]

In [280]:
table.pop() #By default, it removes the pop method removes last item from the list

{'name': 'aaa', 'id': 11, 'sal': 100}

In [281]:
print(table)

[{'name': 'aaa', 'id': 11, 'sal': 100}, {'name': 'bbb', 'id': 23, 'sal': 99}, {'name': 'cc', 'id': 24, 'sal': 'null'}]

In [282]:
table.pop()

{'name': 'cc', 'id': 24, 'sal': 'null'}

In [12]:
print(table)

[{'name': 'aaa', 'id': 11, 'sal': 100}, {'name': 'bbb', 'id': 23, 'sal': 99}]

In [275]:
#give a specific condition
for item in names: 
    if (item == 'bbb'):    
        names.remove(item)
        
print(names)

['aaa', 'cc']

# Pandas 

Pandas is a Python library used for working with data sets. It has functions for analyzing, cleaning, exploring, and manipulating data.

You can check the documentation of Pandas using [Pandas Documentation](https://pandas.pydata.org/docs/)

In [17]:
import pandas as pd         

df = pd.DataFrame(table, columns = ["name", "id", "sal"])       #create a DataFrame using pandas
print(df)

  name  id  sal
0  aaa  11  100
1  bbb  23   99
2  ddd  33   98

In [39]:
new_data = {
    "name": "ccc",
    "id" : 24,
    "sal" : "null"
}


df = df.append(new_data, ignore_index = True)      #add a new record to the dataframe, we could use concat method as well.

print(df)

  name  id   sal
0  bbb  23    99
1  ccc  24  null
2  aaa  11   100
3  ddd  33    98
4  ccc  24  null

/var/folders/g9/ls79zdln1rl3jp8k_g_4p6s00000gn/T/ipykernel_39482/1458322742.py:8: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(new_data, ignore_index = True)

In [21]:
df1 = df.loc[(df['id'] >= 20) & (df['id'] <=30)]     #split a dataframe based on particular label condition
df2 = df.loc[(df['id'] <20) | (df['id'] > 30)]

print(df1)

  name  id   sal
1  bbb  23    99
3  ccc  24  null

In [22]:
print(df2)

  name  id  sal
0  aaa  11  100
2  ddd  33   98

In [25]:
df = pd.concat([df1, df2]) #concat method

print(df)

  name  id   sal
1  bbb  23    99
3  ccc  24  null
0  aaa  11   100
2  ddd  33    98

In [66]:
import pandas as pd                         

df = pd.DataFrame({
    "name": ["aa", "bb", "Bb", "dd"],
    "id": [4, 5, 6, 10],
    "sal": [10, 20, "null", 30]
})

print(df['name'])

0    aa
1    bb
2    Bb
3    dd
Name: name, dtype: object

**Note**: Here dtype is an object

# Numpy 

You can check the documentation here [Numpy Documentation](https://numpy.org/doc/stable/user/whatisnumpy.html)

In [202]:
import numpy as np                    
name = ["aaa", "bbb", "ccc", "dddd"]
id = [2,3,4,5]
sal = [1000, 2000, pd.NA,4000]

data = np.array([name, id, sal])

print(data)

[['aaa' 'bbb' 'ccc' 'dddd']
 [2 3 4 5]
 [1000 2000 <NA> 4000]]

In [129]:
data.shape

(3, 4)

In [71]:
data[0]

array(['aaa', 'bbb', 'ccc', 'dddd'], dtype='<U21')

In [72]:
data[1]

array(['2', '3', '4', '5'], dtype='<U21')

In [73]:
data[2]

array(['1000', '2000', '3000', '4000'], dtype='<U21')

In [74]:
data[0][0]

'aaa'

In [75]:
data[0][1]

'bbb'

In [76]:
data[1][0]

'2'

In [253]:
student_data = pd.DataFrame({
    'name' : data[0],
    'id' : data[1],
    'sal': data[2]
})

student_data

   name id   sal
0   aaa  2  1000
1   bbb  3  2000
2   ccc  4  <NA>
3  dddd  5  4000

In [187]:
student_data.loc[2]

name     ccc
id         4
sal     <NA>
Name: 2, dtype: object

In [188]:
student_data.loc[1:3]

   name id   sal
1   bbb  3  2000
2   ccc  4  <NA>
3  dddd  5  4000

In [189]:
student_data.iloc[1:3]

  name id   sal
1  bbb  3  2000
2  ccc  4  <NA>

In [190]:
student_data.loc[0, 'id']

2

In [103]:
student_data.loc[0] = 'null'

# Difference b/w loc and iloc

|  | loc | iloc |
| --- | --- | --- |
| Indexing method | Label-based | Integer-based |
| Syntax | `df.loc[row_labels, column_labels]` | `df.iloc[row_positions, column_positions]` |
| Row selection | Uses label names | Uses integer positions |
| Column selection | Uses column names | Uses integer positions |
| Slicing | Inclusive of both start and stop indices | Exclusive of the stop index |
| Example | `df.loc['A', 'X']` selects the value at row 'A' and column 'X' | `df.iloc[0, 0]` selects the value at the first row and first column |
| Performance | Slower when using labels due to additional label resolution step | Faster when using integers since it doesn't require label resolution |

In [204]:
print(student_data)

   name id   sal
0   aaa  2  1000
1   bbb  3  2000
2   ccc  4  <NA>
3  dddd  5  4000

In [276]:
student_data = student_data.isnull()  #to find out missing values

In [277]:
print(student_data)

    name     id    sal
0  False  False  False
1  False  False  False
2  False  False   True
3  False  False  False

In [191]:
print(student_data)

   name id   sal
0   aaa  2  1000
1   bbb  3  2000
2   ccc  4  <NA>
3  dddd  5  4000

In [151]:
student_data.shape

(4, 3)

In [207]:
print(student_data)

   name id   sal
0   aaa  2  1000
1   bbb  3  2000
2   ccc  4   NaN
3  dddd  5  4000

In [169]:
student_data['sal'] = student_data['sal'].replace("null", pd.NA)     #if null is given as a string, replace it with NA first

In [197]:
print(student_data)

   name id   sal
0   aaa  2  1000
1   bbb  3  2000
2   ccc  4     0
3  dddd  5  4000

In [244]:
student_data['sal'] = (student_data['sal'].dropna())    #drop null values

In [245]:
print(student_data)

   name id   sal
0   aaa  2  1000
1   bbb  3  2000
2   ccc  4   NaN
3  dddd  5  4000

In [246]:
student_data['sal'] = student_data['sal'].fillna(student_data['sal'].mean()).round(2) #fill null values with some other meaningful value like mean of the data of that column.

In [247]:
print(student_data)

   name id      sal
0   aaa  2  1000.00
1   bbb  3  2000.00
2   ccc  4  2333.33
3  dddd  5  4000.00

In [248]:
student_data['sal'] = student_data['sal'].astype(int) #convert float types to integer using astype()

In [249]:
print(student_data)

   name id   sal
0   aaa  2  1000
1   bbb  3  2000
2   ccc  4  2333
3  dddd  5  4000

In [229]:
new_data = [{"name": "aaaaa", "id": 5, "sal": 100000}]

df1 = pd.DataFrame(new_data, columns = ['name', 'id', 'sal'])

In [230]:
print(df1)

    name  id     sal
0  aaaaa   5  100000

In [238]:
print(student_data)

    name  id     sal   name   id       sal
0    aaa   2    1000  aaaaa  5.0  100000.0
1    bbb   3    2000    NaN  NaN       NaN
2    ccc   4    2333    NaN  NaN       NaN
3   dddd   5    4000    NaN  NaN       NaN
0  aaaaa   5  100000  aaaaa  5.0  100000.0
0  aaaaa   5  100000  aaaaa  5.0  100000.0

## Concat method for adding a new record to existing dataframe

In [251]:
new_data = {
    "name": "eee",
    "id": 6,
    "sal": 5000
}

df2 = pd.DataFrame([new_data])    #new dataframe created for new record

# concatenate original dataframe and new dataframe
df = pd.concat([student_data, df2], ignore_index=True)

print(df)

   name id   sal
0   aaa  2  1000
1   bbb  3  2000
2   ccc  4  2333
3  dddd  5  4000
4   eee  6  5000

In [254]:
print(df)

   name id   sal
0   aaa  2  1000
1   bbb  3  2000
2   ccc  4  2333
3  dddd  5  4000
4   eee  6  5000

# Query methods

There are several ways to query and filter data in a pandas DataFrame or Series. Here are some of the most common query methods in pandas:

1. df.loc[] and df.iloc[]: As discussed earlier, these methods are used to select rows and columns from a DataFrame or Series based on label or integer position.

2. Boolean indexing: This method involves using a boolean condition to select specific rows or columns from a DataFrame or Series. For example, you can use the syntax df[df['column_name'] > 5] to select rows where the value in 'column_name' is greater than 5.

3. df.query(): This method allows you to filter rows from a DataFrame using a string of boolean expressions. For example, you can use the syntax df.query('column_name > 5') to select rows where the value in 'column_name' is greater than 5.

4. df.filter(): This method is used to select a subset of columns from a DataFrame based on their label or data type. For example, you can use the syntax df.filter(items=['col1', 'col2']) to select only columns 'col1' and 'col2'.

5. df.groupby(): This method is used to group rows in a DataFrame by one or more columns and apply a function to each group. For example, you can use the syntax df.groupby('column_name').mean() to group rows by the unique values in 'column_name' and calculate the mean of each group.

6. df.merge(): This method is used to combine two or more DataFrames based on a common column or index. For example, you can use the syntax df1.merge(df2, on='column_name') to merge two DataFrames on the column 'column_name'.

In [258]:
df = df.drop(df.query('id == 4').index)

In [259]:
print(df)

   name id   sal
0   aaa  2  1000
1   bbb  3  2000
3  dddd  5  4000
4   eee  6  5000

In [260]:
import numpy as np

name = ['a','b']
id = [1,2]
sal = [3,4]

data = np.array([name, id, sal])

print (data)

[['a' 'b']
 ['1' '2']
 ['3' '4']]

In [268]:
df = pd.DataFrame({
    'name' : data[0],
    'id' : data[1],
    'sal' : data[2]
}, index = [1,2])

In [269]:
print(df)

  name id sal
1    a  1   3
2    b  2   4

In [270]:
df = df.drop_duplicates(subset=['name', 'id'])
print(df)

  name id sal
1    a  1   3
2    b  2   4

In [273]:
R = "linkedin"

In [274]:
print(R[4:-4])